### How to handle missing data

Three main options for handling missing data in cells:
* keep it 
* remove it
* replace it

1. Keep the missing data

* PROS:
    * easiest to do
    * does not manipulate or change the true data
* CONS:
    * many (ML) methods do not support NaN entries
    * often there are reasonable guesses to fix the data

2. Drop or remove the missing data

* PROS:
    * easy to do
    * can be based on rules (by col, by row, etc)
* CONS:
    * potential to lose a lot of data or useful info
    * limits trained model for future data

Note: when dropping a row, it is a good idea to keep track of how much data was removed from the dataset. For example, if you data has 10 rows but one row is missing a majority of the features (column values) then you can drop that row and we would say that we dropped 1/10 or 10% of the data in this small example.

3. Filling in the missing data

* PROS:
    * potential to save a lot of data for use in training a model
    * this is a good choice when NaN is just a placeholder for ZERO
* CONS:
    * hardest to do
    * somewhat arbitrary
    * potential to lead to false conclusions if your filled in data is biased or incorrect

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.nan

nan

In [3]:
np.nan == np.nan  # avoid standard comparisons with nan

False

In [4]:
var = np.nan
var is np.nan

True

In [5]:
df = pd.read_csv('./data/movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [6]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [7]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [9]:
df[df['pre_movie_score'].notnull()]  # filtering

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [10]:
df[df['pre_movie_score'].isnull()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [11]:
df[(df['pre_movie_score'].isnull()) & (df['first_name'].notnull())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [12]:
# KEEP DATA
# DROP DATA
# FILL DATA

In [13]:
# help(drop.na)

In [14]:
df.dropna()  # default drop missing values

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [17]:
df.dropna(thresh=1)  # drop unless row has at least one non-null value

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [19]:
df.dropna(axis=1)  # drop columns

# this drops everything! not what we want..

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [20]:
df.dropna(subset=['last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [21]:
# help(df.fillna)

In [23]:
df.fillna('NEW VALUE!')  # replaces all NaN with this new string (typically do not do this)

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63,m,8,10
1,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!
2,Hugh,Jackman,51,m,NEW VALUE!,NEW VALUE!
3,Oprah,Winfrey,66,f,6,8
4,Emma,Stone,31,f,7,9

In [25]:
# df = df['pre_movie_score'].fillna(0)

# df

0    8.0
1    0.0
2    0.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [26]:
df = pd.read_csv('./data/movie_scores.csv')

In [27]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [29]:
df['pre_movie_score'].mean()  # gives the average based on the existing values only

7.0

In [30]:
df['pre_movie_score'].fillna( df['pre_movie_score'].mean() )

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [31]:
df.fillna(df.mean())

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1        NaN       NaN  52.75  NaN              7.0               9.0
2       Hugh   Jackman  51.00    m              7.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

### Filling with Interpolation

In [32]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [33]:
ser = pd.Series(airline_tix)
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [34]:
# linear interp (must be ordered to use this properly)
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64